Revit 2026 API

# CriticalPathIteratorCurrent Property

---

Gets the item at the current position of the iterator.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual MEPNetworkSegmentId Current { get; }
```
```vb
Public Overridable ReadOnly Property Current As MEPNetworkSegmentId
	Get
```
```cpp
public:
virtual property MEPNetworkSegmentId^ Current {
	MEPNetworkSegmentId^ get ();
}
```
```fsharp
abstract Current : MEPNetworkSegmentId with get
override Current : MEPNetworkSegmentId with get
```

#### Property Value

MEPNetworkSegmentId

#### Implements

IEnumeratorTCurrent

| Exception | Condition |
| --- | --- |
| InvalidOperationException | There is no current item in the iterator. |

There is no current item if the iterator has not started yet or has been done.

#### Reference

CriticalPathIterator Class

Autodesk.Revit.DB.Analysis Namespace